tutorials/flowOverCylinder/flowOverCylinder/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 45;

vertices
(
    (-1 -1 0)     //0
    (1 -1 0)      //1
    (1 1 0)       //2
    (-1 1 0)      //3
    (-1 -1 0.006666)  //4
    (1 -1 0.006666)   //5
    (1 1 0.006666)    //6
    (-1 1 0.006666)   //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (90 90 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch top
    (
        (3 7 6 2)
    )
    patch inlet
    (
        (0 4 7 3)
    )
    patch outlet
    (
        (2 6 5 1)
    )
    patch bottom
    (
        (1 5 4 0)
    )
    empty frontAndBack
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
