tutorials/flowOverCylinder/flowOverCylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    top
    {
        type            patch;
        nFaces          90;
        startFace       16020;
    }
    inlet
    {
        type            patch;
        nFaces          90;
        startFace       16110;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       16200;
    }
    bottom
    {
        type            patch;
        nFaces          90;
        startFace       16290;
    }
    frontAndBack
    {
        type            empty;
        nFaces          16200;
        startFace       16380;
    }
)

// ************************************************************************* //
